Revit 2027 API
EmbodiedCarbonAsset.CarbonCoefficient Property
 Used by Insight, unit is kgCO₂e per length, area, etc., e.g 200.234 kgCO₂e/m
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double CarbonCoefficient { get; }
Public ReadOnly Property CarbonCoefficient As Double
	Get
public:
property double CarbonCoefficient {
	double get ();
}
member CarbonCoefficient : float with get
Property Value
Double
See Also
Reference
EmbodiedCarbonAsset Class
Autodesk.Revit.DB Namespace